
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 2 to change, 1 to destroy.</code></pre>

* Update
  * azurerm_key_vault_secret.appInsights-InstrumentationKey
  * module.vault.azurerm_monitor_diagnostic_setting.kv-ds
* Replace
  * module.application_insights.azurerm_application_insights.this


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.appInsights-InstrumentationKey will be updated in-place
  ~ resource "azurerm_key_vault_secret" "appInsights-InstrumentationKey" {
        id                      = "https://crumblesi-sandbox.vault.azure.net/secrets/appInsights-InstrumentationKey/c2f2a2d03fff4d35a75cde939c89617a"
        name                    = "appInsights-InstrumentationKey"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)

      - timeouts {}
    }

  # module.application_insights.azurerm_application_insights.this must be replaced
  # (moved from azurerm_application_insights.appinsights)
-/+ resource "azurerm_application_insights" "this" {
      ~ app_id                                = "133be871-40d0-4545-bf7f-7e263af16902" -> (known after apply)
      ~ connection_string                     = (sensitive value)
      ~ daily_data_cap_in_gb                  = 100 -> 50
      ~ daily_data_cap_notifications_disabled = false -> (known after apply)
      ~ id                                    = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/crumble-shared-infrastructure-sandbox/providers/Microsoft.Insights/components/crumble-sandbox" -> (known after apply)
      ~ instrumentation_key                   = (sensitive value)
      ~ name                                  = "crumble-sandbox" -> "crumble-sandbox-sandbox" # forces replacement
      ~ tags                                  = {
          - "Team Contact"        = "#Cloud-Native" -> null
            "application"         = "core"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/cnp-plum-shared-infrastructure.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#platops-help"
            "environment"         = "sandbox"
            "expiresAfter"        = "2024-01-10"
            "managedBy"           = "CNP"
            "startupMode"         = "onDemand"
        }
      + workspace_id                          = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-sandbox"
        # (10 unchanged attributes hidden)
    }

  # module.vault.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                             = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/crumble-shared-infrastructure-sandbox/providers/Microsoft.KeyVault/vaults/crumblesi-sandbox|crumblesi-sandbox"
        name                           = "crumblesi-sandbox"
        # (3 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":117,"Program":"tfcmt","SHA1":"","Vars":{}} -->